//请你来实现一个 atoi 函数，使其能将字符串转换成整数。 
//
// 首先，该函数会根据需要丢弃无用的开头空格字符，直到寻找到第一个非空格的字符为止。接下来的转化规则如下： 
//
// 
// 如果第一个非空字符为正或者负号时，则将该符号与之后面尽可能多的连续数字字符组合起来，形成一个有符号整数。 
// 假如第一个非空字符是数字，则直接将其与之后连续的数字字符组合起来，形成一个整数。 
// 该字符串在有效的整数部分之后也可能会存在多余的字符，那么这些字符可以被忽略，它们对函数不应该造成影响。 
// 
//
// 注意：假如该字符串中的第一个非空格字符不是一个有效整数字符、字符串为空或字符串仅包含空白字符时，则你的函数不需要进行转换，即无法进行有效转换。 
//
// 在任何情况下，若函数不能进行有效的转换时，请返回 0 。 
//
// 提示： 
//
// 
// 本题中的空白字符只包括空格字符 ' ' 。 
// 假设我们的环境只能存储 32 位大小的有符号整数，那么其数值范围为 [−231, 231 − 1]。如果数值超过这个范围，请返回 INT_MAX (231
// − 1) 或 INT_MIN (−231) 。 
// 
//
// 
//
// 示例 1: 
//
// 输入: "42"
//输出: 42
// 
//
// 示例 2: 
//
// 输入: "   -42"
//输出: -42
//解释: 第一个非空白字符为 '-', 它是一个负号。
//     我们尽可能将负号与后面所有连续出现的数字组合起来，最后得到 -42 。
// 
//
// 示例 3: 
//
// 输入: "4193 with words"
//输出: 4193
//解释: 转换截止于数字 '3' ，因为它的下一个字符不为数字。
// 
//
// 示例 4: 
//
// 输入: "words and 987"
//输出: 0
//解释: 第一个非空字符是 'w', 但它不是数字或正、负号。
//     因此无法执行有效的转换。 
//
// 示例 5: 
//
// 输入: "-91283472332"
//输出: -2147483648
//解释: 数字 "-91283472332" 超过 32 位有符号整数范围。 
//     因此返回 INT_MIN (−231) 。
// 
// Related Topics 数学 字符串 
// 👍 904 👎 0
package main

import (
	"math"
)

//leetcode submit region begin(Prohibit modification and deletion)
func myAtoi(s string) int {

	/*
	  解题思路：将字符串按照数组处理，将每一个数字字符转成数字  '1' - '0' = 1，'2'-'0'= 0 ， 当前的值  res = res*10+ first
	 处理其他问题  +,- 号问题  用一个标志位记录第一次非空有效字符出现 ： 当是- ，flag =-1, 负责 flag =1
	 处理空格问题： 当是空格且 有效字符还没有出现的时候 忽略 //"   +0 123",
	 当出现第一个字符不是有效字符的时候，直接返回当前的值。
	 在我们的值是有效数字的过程中，我们需要不断的去判断当前值是否溢出的情况， 又肯已经超出 整形的返回，则直接返回整形的最值。
	 */
	var res int64
	sub := '0'
	var flag  int64 = 1

	isFirst := true

	for _,val := range s {
		if val == ' ' && isFirst {
			continue
		}

		if (val >= '0' && val <= '9') || ((val == '-' || val == '+') && isFirst) {
			//  默认为正号 ，出现 '- '的时候处理一下
			if isFirst == true {
				isFirst = false
				if val == '-' {
					flag = -1
					continue
				}
			}
			if val >= '0' && val <= '9' {
				res = res*10 + int64(val-sub)
				temp := res * flag
				if temp > math.MaxInt32 {
					return math.MaxInt32
				} else if temp < math.MinInt32 {
					return math.MinInt32
				}
			}
		}else {
			break
		}
	}
	//  判断是否溢出
	return int(res*flag)
}
//leetcode submit region end(Prohibit modification and deletion)

//func main()  {
//	strArr := []string {
//		"42",
//		//"   42",
//		"   -42",
//		//"   --42",
//		"words and 987",
//		//"987word",
//		//"-91283472332",
//		//"   +0 123",
//		//"9223372036854775808",
//	}
//	//strArr = append(strArr, strconv.Itoa(math.MaxInt32 +1 ),strconv.Itoa(math.MinInt32  - 1 ))
//	for _,str :=range strArr{
//		res :=  myAtoi(str)
//		fmt.Printf("res = %v\n",res)
//	}
//}


